file
#  لتحديد نوع الملف 
---------------------------------
less
#  لعرض محتويات الملفات النصية 
-----------------------------------
 locate
 يقوم هذا الامر بالبحث في النظام عن الملفات
 locate bin/zip
#  حيث انه بالمثال فوق عم يبحث بمجلد فيه العبارة bin عن كل الملفات التي تبدأ ب zip 
warning!:
# if we dont see our wanted file we have to update database
updatedb
--------------------------------------
find path_search -options Conditional_or_fileName verb
find /home -name "hosam.txt"
# هي التعليمة شغلتها تبحث بشكل اعمق واعقد اول شي بنحطلا مسار  البحث بعدين الخيارات بعدين الشرط او اسم الملف
find ~ -type f -name '*.BAK' -delete 
# هون عم بنقله انو ابحثلي عن كل الملفات يلي بتنتها بكزا واحذفهم
and-or-not
# يمكننا ان نجمع بين شرطين او دمج عمليتي بحث سويا
(expression1) -and,-or,-not (expression2)
xargs
# هي التعليمة بتنكتب بعد الانبوب لحتى تمرر معطيات امر سابق الى فعل معين ف وظيفتها انو تكرر تمرير الناتج للفعل يلي ما بيقبل الى معطية وحدة متل الامر rm 
find ~ type f -name "*.html" | xargs rm
----------------------------------------
gzip 
# يستخدم هذا الامر لضغط الملفات 
gzip hosam.txt
gunzip hosam.txt.gz
gzip -r 
# لضغط الملفات 
gzip -v 
# لضغط الملفات مع رؤية التقدم 
gzip --fast 
# لضغط الملف بسرعة 
gzip --best 
# لضغط الملف ببطئ لكن ضغط اكبر
gunzip -c 
# لرؤية محتوى الملف فقط
--------------------------------------
tar الأرشفة
tar option (path_of_saving(ملاحظة انو هي بس بنستخدمها وقت بدنا بنساوي ارشيف)) path_file/folder
# خيارات tar
c -->create
# لانشاء ارشيف من مجموعة من الملفات و المجلدات 
x 
# استخراج محتوى الارشيف
r 
# اضافة مسارات محددة الى نهاية الارشيف 
t -->tree
# عرض قائمة بمحتوى الارشيف
tar xf playground.tar file_path
# يستخدم هاد الامر لاستخراج ملف واحد بتحديد مساره
------------------------------------------------
zip hosam.txt
unzip hosa.txt
# نفس الشي بقوم بالضغط وفك الضغط
unzip -l 
# يقوم بعرض محتويات الملف المضغوط دون فك الضغط 
-------------------------------------------------
rsync
rsync options source destination
# يستخدم لمزامنة الملفات بين الجهاز المصدر والجهاز الوجهة
# ملاحظة هامة :
-v
# هاد الخيار ضروري جدا لانه بيعمل نسخة طبق الاصل عن الملف او المجلد الاصل 
[me@linuxbox ~]$ sudo rsync -av --delete --rsh=ssh /etc /home
/usr/local remote-sys:/backup
# يستخدم هذا الامر لنسخ الملفات نسخا احتياطيا بين جهاز محلي وجهاز على الشبكة
[me@linuxbox ~]$ mkdir fedora-devel
[me@linuxbox ~]$ rsync -av -delete rsync://rsync.gtlib.gatech.edu/fed
ora-linux-core/development/i386/os fedora-devel
# المزامنة من سيرفر بعيد
-----------------------------------------------------
cut 
month_login_date=$(who /var/run/utmp | awk -v line=$((j+1)) 'NR==line {print $3}' | cut -d'-' -f2)
حيث انو هون اخدتلي الناتج تبع التاريخ وعلمت انا الاداة عبر -d انو الفاصل بين الحقول هوي الشرطة وال f حددتلي الحقل انو يلي بدي قصه 
# تستخدم هي التعليمة لقص حقل من ملف
awk 
usage=$(df -h /dev/mapper/cs-root | awk 'NR==2 {print $5}')
echo "$usage"
# شغلتها انو تاخد العمود يلي انا بدي ياه من السطر يلي انا بدي ياه
paste 
# تستخدم هي التعليمة ل لصق الحقول واضافتها
-----------------------------------------------------
comm,diff
# تستخدم هي التعليمة لنقوم بالمقارنة بين ملفين نصيين ونطلع الفرق بينهم
[me@linuxbox ~]$ comm file1.txt file2.txt
patch
patch < patch.txt
# يستخدم لاضافة التحديثات على الاكواد المصدرية
------------------------------------------------------
aspell
aspell check hosam.txt
# يستخدم هذا الامر للتدقيق الاملائي
--------------------------------------------------------
sed -i
# تستخدم هي التعليمة مشان نقوم باستبدال المحارف 
--------------------------------------------------------
nl  --> number lines
# يستخدم هذا الامر لترقيم الاسطر 
---------------------------------------------------------
printf
# وظيفته طباعة العبارات المنسقة

