# لدينا محرر نصوص اهم من nano
# الذي هو vi
# للخروج من vi يجب علينا 
:q 
# واذا اردنا ان نخرج حتى على الرغم من انو ما حفظنا الملف
:q!
# للتبديل لوضع الادخال 
i
# الخروج من وضع الادخال
esc
# لحفظ التعديلات 
:w
# للتراجع عن تعديل معين في وضع الاوامر
u
# اذا كنا بدنا نضيف كلام باخر السطر يلي كان محفوظ سابقا نوقف المؤشر على اخر محرف ونضغط a
# اذا اردنا قص السطر الحالي او السطر الحالي وال 4 يلي تحته
dd
5dd
# اذا اردنا نسخ السطر الحالي او الحالي والاربعة يلي تحته
yy
5yy
# اذا اردنا لصق المحتوى 
p
# اذا اردنا ان نقوم بالبحث  عن مطابقة معينة لكلمة معينة
/hosam
# اذا اردنا ان نبحث عن كلمة معينة واستبدالها بكلمة معينة
:%s/Line/line/g

